/*----------------------------------------------------------------------------------------------------*/
// 과제 1. 계산기
// const a = 20;
// const b = 3;

// 출력
// 덧셈
// console.log(a + b);
// 뺄셈
// console.log(a - b);
// 곱셈
// console.log(a * b);
// 나눗셈
// console.log(a / b);
// 나머지
// console.log(a % b);
// 거듭제곱
// console.log(a ** b);
/*----------------------------------------------------------------------------------------------------*/
// 과제 2. 성인 판별
// const age = 17;
// if(age >= 19){
//     console.log("성인");
// } else {
//     console.log("미성년자");
// }
// 출력
// 미성년자
// 19 이상이면
// 성인
/*----------------------------------------------------------------------------------------------------*/
// 과제 3. 학점 출력
// const score = 85;
// if(score >= 90) {
//     console.log("A학점");
// } else if(score >= 80) {
//     console.log("B학점");
// } else if(score >= 70) {
//     console.log("C학점");
// } else if(score >= 60) {
//     console.log("D학점");
// } else {
//     console.log("F학점");
// }
// 출력
// B학점
// 기준
// 90 이상 → A
// 80 이상 → B
// 70 이상 → C
// 60 이상 → D
// 그 외 → F
/*----------------------------------------------------------------------------------------------------*/
// 과제 4. 요일 출력
// const day = 3;
// switch(day) {
//     case 1:
//         console.log("월요일");
//         break;
//     case 2:
//         console.log("화요일");
//         break;
//     case 3:
//         console.log("수요일");
//         break;
//     case 4:
//         console.log("목요일");
//         break;
//     case 5:
//         console.log("금요일");
//         break;
//     case 6:
//         console.log("토요일");
//         break;
//     case 7:
//         console.log("일요일");
//         break;
//     default:
//         console.log("잘못된 요일");
// }
// 출력
// 수요일
// switch 문을 사용하여 작성해 보세요.
// 1 → 월요일
// 2 → 화요일
// 3 → 수요일
// 4 → 목요일
// 5 → 금요일
// 6 → 토요일
// 7 → 일요일
/*----------------------------------------------------------------------------------------------------*/
// 과제 5. 로그인 상태
// const isLogin = false;
// const message = isLogin ? "환영합니다." : "로그인 필요";
// console.log(message);
// 삼항 연산자를 사용해서
// 출력
// 로그인 필요
// 또는
// 환영합니다.
/*----------------------------------------------------------------------------------------------------*/
// 과제 6. Optional Chaining
const user = null;

// 안전하게 이름을 출력해 보세요.
console.log(user?.name);
/*----------------------------------------------------------------------------------------------------*/
