// 과제 1. 자기소개 함수
function introduce(name) {
    console.log(`안녕하세요. 저는 ${name}입니다.`);
}
// 호출
introduce("홍길동");
// 출력
// 안녕하세요. 저는 홍길동입니다.
/*----------------------------------------------------------------------------------------------------*/
// 과제 2. 덧셈 함수
function add(a, b) {
    return a + b;
}
// 호출
console.log(add(10, 20));
// 출력
// 30
/*----------------------------------------------------------------------------------------------------*/
// 과제 3. BMI 계산
// 공식
// 몸무게 / (키 * 키)
// 키는 미터(m) 단위입니다.
// 예)
// console.log(bmi(70, 1.75));
const bmi = (weight, height) => {
    return weight / (height * height);
}
console.log(bmi(70, 1.75).toFixed(2));
// 출력
// 22.86
// 소수 둘째 자리까지 출력해 보세요.
// 힌트
// toFixed(2)
/*----------------------------------------------------------------------------------------------------*/
// 과제 4. 원의 넓이
function circle(radius) {
    return Math.PI * radius * radius;
}
console.log(circle(5).toFixed(2));
// 공식
// π × r × r
// Math.PI를 사용하세요.
/*----------------------------------------------------------------------------------------------------*/
// 과제 5. 화살표 함수
// 다음 함수를 화살표 함수로 바꿔 보세요.
function multiply(a, b) {
    return a * b;
}
multiply = (a, b) => a * b;
console.log(multiply(10, 5));
/*----------------------------------------------------------------------------------------------------*/
// 과제 6. 기본 매개변수
function hello(name = "손님") {
    console.log(`안녕하세요 ${name}`);
}
// 호출
hello();
hello("홍길동");
// 출력
// 안녕하세요 손님
// 안녕하세요 홍길동
/*----------------------------------------------------------------------------------------------------*/
// 과제 7. 계산기
// 함수 4개를 만들어 보세요.

const add1 = (a, b) => a + b;
const subtract = (a, b) => a - b;
const multiply1 = (a, b) => a * b;
const divide = (a, b) => a / b;
// 실행
console.log(add1(10, 5));
console.log(subtract(10, 5));
console.log(multiply1(10, 5));
console.log(divide(10, 5));
// 출력
// 15
// 5
// 50
// 2
/*----------------------------------------------------------------------------------------------------*/
