/*----------------------------------------------------------------------------------------------------*/
// 과제 1. 학생 객체 만들기
const student = {
    name: "홍길동",
    age: 20,
    major: "컴퓨터공학"
};
console.log(student);
// 출력
// 홍길동
// 20
// 컴퓨터공학
/*----------------------------------------------------------------------------------------------------*/
// 과제 2. 객체 수정
// 위 객체에서
// 나이를 21로 변경
// 직업(job) 추가
// 전공(major) 삭제
// 출력
student.age = '21';
student.job = '개발자';
console.log(student);
delete student.major;
console.log(student);
// {
//     name: "홍길동",
//     age: 21,
//     job: "개발자"
// }
/*----------------------------------------------------------------------------------------------------*/
// 과제 3. 객체 메서드
const person = {
    name: "홍길동",

    introduce() {
        console.log("안녕하세요. 저는 " + person.name + "입니다.");
    }
};
// 출력
person.introduce();
// 안녕하세요. 저는 홍길동입니다.
/*----------------------------------------------------------------------------------------------------*/
// 과제 4. 구조 분해 할당
const book = {
    title: "JavaScript",
    author: "홍길동",
    price: 30000
};
const { title, author, price } = book;
console.log(title);
console.log(author);
console.log(price);
// 구조 분해를 사용하여
// JavaScript
// 홍길동
// 30000
// 을 출력해 보세요.
/*----------------------------------------------------------------------------------------------------*/
// 과제 5. 학생 목록 출력
const students = [
    {
        name: "홍길동",
        score: 90
    },
    {
        name: "김철수",
        score: 80
    },
    {
        name: "이영희",
        score: 95
    }
];
for (const student of students) {
    console.log(student.name, " : " , student.score);
}
// 반복문을 사용하여
// 홍길동 : 90
// 김철수 : 80
// 이영희 : 95
// 를 출력해 보세요.
/*----------------------------------------------------------------------------------------------------*/
// 과제 6. 평균 점수 구하기
// 위 students 배열을 사용하여 평균 점수를 계산해 보세요.
// 출력
// 평균 : 88.33
// 힌트
let sum = 0;
for (const student of students) {
    sum += student.score;
}
console.log("평균 : " + (sum/3).toFixed(2));
/*----------------------------------------------------------------------------------------------------*/
// 과제 7. 90점 이상 학생만 출력
// 출력
// 홍길동
// 이영희

for (const student of students) {
    if(student.score >= 90){
        console.log(student.name);
    }
}
/*----------------------------------------------------------------------------------------------------*/