/*----------------------------------------------------------------------------------------------------*/
// 과제 1. 음식 추가
const foods = [
    "피자",
    "치킨",
    "햄버거"
];
// push()를 사용하여
// 초밥
// 을 추가하세요.
foods.push("초밥");
console.log(foods);
/*----------------------------------------------------------------------------------------------------*/
// 과제 2. 마지막 음식 삭제
// pop()을 사용하세요.
foods.pop();
console.log(foods);
/*----------------------------------------------------------------------------------------------------*/
// 과제 3. 앞에 음식 추가
// unshift()를 사용하여
// 라면
// 을 추가하세요.
foods.unshift("라면");
console.log(foods);
/*----------------------------------------------------------------------------------------------------*/
// 과제 4. 80점 이상 학생 찾기
const students = [
    {name:"홍길동",score:90},
    {name:"김철수",score:70},
    {name:"이영희",score:95}
];
// filter()를 사용하세요.
// 출력
// 홍길동
// 이영희
const result2 = students.filter(student => student.score >= 80);
result2.forEach(student => {
    console.log(student.name);
});
/*----------------------------------------------------------------------------------------------------*/
// 과제 5. 이름만 출력
// map()을 사용하세요.
// 출력
// ["홍길동","김철수","이영희"]
const result3 = students.map(student => student.name);
console.log(result3);
/*----------------------------------------------------------------------------------------------------*/
// 과제 6. 평균 점수
// reduce()를 사용하세요.
// 출력
// 85
const avg = students.reduce((sum,student)=>sum+student.score,2)/students.length;
console.log(avg);
/*----------------------------------------------------------------------------------------------------*/
// 과제 7. 김철수 찾기
// find()를 사용하세요
// 출력
// {
//     name:"김철수",
//     score:70
// }
const user = students.find(student => student.name === "김철수");
console.log(user);
/*----------------------------------------------------------------------------------------------------*/
// 과제 8. 100점 학생이 있는지 확인
// some()을 사용하세요.
// 출력
// false
console.log(students.some(student => student.score >= 100));
/*----------------------------------------------------------------------------------------------------*/
// 과제 9. 모두 60점 이상인지 확인
// every()를 사용하세요.
// 출력
// true
console.log(students.every(student => student.score >= 60));
/*----------------------------------------------------------------------------------------------------*/