/*----------------------------------------------------------------------------------------------------*/
// 과제 1. Template Literal
const name = "홍길동";
const age = 20;
console.log(`과제 1. Template Literal`);
console.log(`안녕하세요. 저는 ${name}이고 ${age}살입니다.`);
// 출력
// 안녕하세요. 저는 홍길동이고 20살입니다.
// +를 사용하지 말고 작성하세요.
/*----------------------------------------------------------------------------------------------------*/
// 과제 2. 배열 합치기
const arr1 = [1,2,3];
const arr2 = [4,5,6];
const result = [...arr1,...arr2];
// Spread 문법을 사용하여
// [1,2,3,4,5,6]
// 을 만들어 보세요.
console.log(`과제 2. 배열 합치기`);
console.log(result);
/*----------------------------------------------------------------------------------------------------*/
// 과제 3. 객체 복사
const user = {
    name:"홍길동",
    age:20
};
// Spread 문법을 이용하여
const newUser= {
    ...user
};
// 를 만드세요.
console.log(`과제 3. 객체 복사`);
console.log(user);
/*----------------------------------------------------------------------------------------------------*/
// 과제 4. Rest Parameter
// 다음 함수를 작성하세요.
// sum(10,20,30,40);
// 출력
// 100
console.log(`과제 4. Rest Parameter`);
function sum(...numbers){
    return numbers.reduce(
        (sum,num)=>sum+num,
        0
   );
}
console.log(sum(10,20,30,40));
/*----------------------------------------------------------------------------------------------------*/
// 과제 5. 배열 구조 분해
const foods = [
    "피자",
    "치킨",
    "햄버거"
];
// 첫 번째와 두 번째 음식만 변수에 저장하세요.
// 출력
// 피자
// 치킨
const [first, second] = foods;
console.log(first);
console.log(second);
/*----------------------------------------------------------------------------------------------------*/
// 과제 6. 객체 구조 분해
const student2 = {
    name2:"홍길동",
    score:90
};
// 구조 분해를 사용하여
// 홍길동
// 90
// 을 출력하세요.
const {name2, score} = student2;
console.log(name2);
console.log(score);
/*----------------------------------------------------------------------------------------------------*/
// 과제 7. Optional Chaining
const user3 = null;
// 오류 없이 이름을 출력해 보세요.
// 출력
// undefined
console.log(user3?.name);
/*----------------------------------------------------------------------------------------------------*/
// 과제 8. Nullish Coalescing
const nickname = null;
// 출력
// 손님
// ??를 사용하세요.
console.log(nickname ?? "손님");
/*----------------------------------------------------------------------------------------------------*/
// 과제 9. 객체 속성 축약
const title = "Vue";
const price = 30000;
// 축약 문법으로 객체를 만들어 보세요.
// 출력
// {
//     title:"Vue",
//     price:30000
// }
const book = {
    title,
    price
};
console.log(book);
/*----------------------------------------------------------------------------------------------------*/